Revit 2027 API
BuiltInFailures.TrussFailures.TrussBadTransformation Property
 Revit cannot transform the truss Layout Family to the Truss as oriented in the project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TrussBadTransformation { get; }
Public Shared ReadOnly Property TrussBadTransformation As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TrussBadTransformation {
	FailureDefinitionId^ get ();
}
static member TrussBadTransformation : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.TrussFailures Class
Autodesk.Revit.DB Namespace